/*
1582年以来的置闰规则：
普通闰年：公历年份是4的倍数，且不是100的倍数的，为闰年（如2004年、2020年等就是闰年）。
世纪闰年：公历年份是整百数的，必须是400的倍数才是闰年（如1900年不是闰年，2000年是闰年）。
1582年以前的惯例：四年一闰；如果公元A年的A（正数）能被4整除，那么它就是闰年。
*/
#include<iostream>
using namespace std;
int main()
{
	int a, b;//a=year;b=month
	cin >> a >> b;
	if (b != 2)
	{
		if (b == 1 || b == 3 || b == 5 || b == 7 || b == 8 || b == 10 || b == 12)cout << "31";
		else cout << "30";
	}
	if (b == 2)
	{
		if (a < 1582)
		{
			int n = (a % 4 == 0) ? 29 : 28;
			cout << n;
		}
		else
		{
			if ((a % 4 == 0 && a % 100 != 0) || (a % 400 == 0))cout << "29";
			else cout << "28";
		}
	}
	return 0;
}